// /** @file
//
// Copyright (c) 2010 - 2015, Byosoft Corporation.<BR>
// All rights reserved.This software and associated documentation (if any)
// is furnished under a license and may only be used or copied in
// accordance with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be reproduced,
// stored in a retrieval system, or transmitted in any form or by any
// means without the express written consent of Byosoft Corporation.
//
// File Name:
//
// Abstract:
//   Platform configuration setup.
//
// Revision History:
//
//
// **/
/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"

#string    STR_EMPTY                     #language en-US ""
                                         #language zh-Hans ""
#string    STR_ENABLED                   #language en-US "Enabled"
                                         #language zh-Hans "\wide打开\narrow"
#string    STR_DISABLED                  #language en-US "Disabled"
                                         #language zh-Hans "\wide关闭\narrow"
#string    STR_NONE                      #language en-US "None"
                                         #language zh-Hans "\wide无\narrow"
#string    STR_AUTO                      #language en-US "Auto"

#string FORMSET_TITLE_MAIN              #language en-US "Main"
                                        #language zh-Hans  "\wide主菜单\narrow"
#string FORMSET_TITLE_MAIN_HELP         #language en-US "Main"
                                        #language zh-Hans  ""\wide主菜单\narrow""
#string FORMSET_TITLE_ADVANCED          #language en-US "Advanced"
#string FORMSET_TITLE_ADVANCED_HELP     #language en-US "Advanced Menu Settings"
#string FORMSET_TITLE_DEVICE            #language en-US "Devices"
#string FORMSET_TITLE_DEVICE_HELP       #language en-US "Devices Settings"
#string FORMSET_TITLE_POWER             #language en-US "Power"
#string FORMSET_TITLE_POWER_HELP        #language en-US "Power Menu Settings"
#string FORMSET_TITLE_SECURITY          #language en-US "Security"
                                        #language zh-Hans "\wide安全\narrow"
#string FORMSET_TITLE_SECURITY_HELP     #language en-US "Security Settings"
                                        #language zh-Hans "\wide安全配置\narrow"
#string STR_SECURITY_BANNER_ONE         #language en-US "Password Description"
                                        #language zh-Hans "Password Description"
#string STR_SECURITY_BANNER_TWO         #language en-US "Administrator's password and User's password all"
                                        #language zh-Hans "Administrator's password and User's password all"
#string STR_SECURITY_BANNER_THREE       #language en-US "can enter setup and OS,but Administrator's password"
                                        #language zh-Hans "can enter setup and OS,but Administrator's password"
#string STR_SECURITY_BANNER_FOUR        #language en-US "control the behavior of User's,for example,"
                                        #language zh-Hans "control the behavior of User's,for example,"
#string STR_SECURITY_BANNER_FIVE        #language en-US "Access level and Clear password."
                                        #language zh-Hans "Access level and Clear password."
#string STR_ADMIN_PASSWORD              #language en-US "Administrator Password"
                                        #language zh-Hans "Administrator Password"
#string STR_CLEAR_USER_PASSWORD         #language en-US "Clear User Password"
                                        #language zh-Hans "Clear User Password"
#string STR_CLEAR_USER_PASSWORD_HELP    #language en-US   "Set User Password to Empty."
                                        #language zh-Hans "Set User Password to Empty."
#string STR_SET_ADMIN_PASSWORD          #language en-US   "Set Administrator Password"
                                        #language zh-Hans "Set Administrator Password"
#string STR_ADMIN_PASSWORD_HELP         #language en-US   "Set Setup Administrator Password, Password must be 6 to 20 alpha numeric characters. Default password is Empty."
#string STR_POWERON_PASSWORD            #language en-US   "PowerOn Password"
#string STR_SET_POWERON_PASSWORD        #language en-US   "Set Power On Password"
#string STR_POWERON_PASSWORD_HELP       #language en-US   "Set Power On Password, Password must be 6 to 20 alpha numeric characters. Default password is Empty."
#string STR_PASSWORD_INSTALLED          #language en-US "Installed"
#string STR_PASSWORD_UNINSTALLED        #language en-US "Uninstalled"
#string STR_PASSWORD_ACCESS_LIMITED     #language en-US "Limited Access"
#string STR_PASSWORD_ACCESS_FULL        #language en-US "Full Access"
#string STR_PASSWORD_ACCESS_NO          #language en-US "No Access"
#string STR_SETUP_HDD_PASSWORD_CONFIG   #language en-US "Hard Disk Password"
#string STR_SETUP_HDD_PASSWORD_CONFIG_HELP   #language en-US   "Configure hard disk password."
#string STR_SETUP_SECUREBOOT_TITLE      #language en-US "Secure Boot Configuration"
#string STR_SETUP_TPM_CONFIG            #language en-US "TPM1.2"
#string STR_SETUP_TPM2_CONFIG           #language en-US "TPM2"
#string STR_SETUP_TCM_CONFIG            #language en-US "TCM"
#string STR_SETUP_TC_CONFIG             #language en-US "Trust Compute Config"


#string FORMSET_TITLE_EXIT              #language en-US "Exit"
#string FORMSET_TITLE_EXIT_HELP         #language en-US "Exit Options"
#string STR_SAVE_EXIT                   #language en-US "Save Changes and Exit"
#string STR_SAVE_EXIT_HELP              #language en-US "Exit system Setup after saving the changes."
#string STR_DISCARD_EXIT                #language en-US "Discard Changes and Exit"
#string STR_DISCARD_EXIT_HELP           #language en-US "Exit system Setup without saving any changes."
#string STR_RESTORE_DEFAULTS            #language en-US "Load Optimal Defaults"
#string STR_RESTORE_DEFAULTS_HELP       #language en-US "Restore/Load defaults values for all the Setup options."

#string STR_SAVE_USER_DEFAULTS          #language en-US "Save as User Default Values"
#string STR_SAVE_USER_DEFAULTS_HELP     #language en-US "Save the changes made so far as User Defaults."
#string STR_RESTORE_USER_DEFAULTS       #language en-US "Load User Default Values"
#string STR_RESTORE_USER_DEFAULTS_HELP  #language en-US "Load the User Defaults to all the setup options."



// Reset
#string STR_RESET                       #language en-US "Reset"
#string STR_RESET_HELP                  #language en-US "Reset System"
#string RESET_MAIN                      #language en-US "Reset"
#string STR_STANDARD_DEFAULT_PROMPT     #language en-US "Standard Default"
#string STR_MANUFACTURE_DEFAULT_PROMPT  #language en-US "Manufacture Default"
#string STR_PROCESSOR_TYPE              #language en-US "Processor Type"
#string STR_MAIN_LANGUAGE_SELECT        #language en-US  "Select Language"
#string STR_MAIN_LANGUAGE_SELECT_HELP   #language en-US  "This is the option one adjusts to change the language for the current system"
#string STR_CLEAR_EVENT_LOG_WARNING     #language en-US  "  All system event log will be cleared immediately!"
#string STR_WARNING_TITLE               #language en-US  "Setup Warning"

                                        
#string STR_SECUREBOOT_TITLE            #language en-US "Secure Boot"
#string STR_SECUREBOOT_HELP             #language en-US "Secure boot settings, include enable/disable function and remove/restore keys." 
                                       
#string STR_TXT_CONFIG             #language en-US "TXT Configuration"  
#string STR_TXT                    #language en-US "TXT"  
#string STR_TXT_HELP               #language en-US "enable/disable TXT."  
